In [1]:
import numpy as np
import pandas as pd

In [2]:
m = np.random.randint(1,30,size = (5,3))

In [3]:
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    13    23    18
1    16    20    15
2    27     9     3
3     5    24    27
4     4    26    28

In [4]:
df2 = df + 99
df2

   var1  var2  var3
0   112   122   117
1   115   119   114
2   126   108   102
3   104   123   126
4   103   125   127

df dataframei değerlerini 99 ile toplayarak yeni bir dataframe oluşturduk

In [5]:
pd.concat([df,df2])

   var1  var2  var3
0    13    23    18
1    16    20    15
2    27     9     3
3     5    24    27
4     4    26    28
0   112   122   117
1   115   119   114
2   126   108   102
3   104   123   126
4   103   125   127

Concat metoduyla yaptığımız birleştirme işlemlerinde satır indeksleri ana dfde olduğu gibi gelir. Kaldığı satır indeksinden devam etmez

Bunu engellemek için yani doğal indekslemenin devam etmesi için **ignore_index** parametresini True yapabiliriz

In [6]:
pd.concat([df,df2],ignore_index = True)

   var1  var2  var3
0    13    23    18
1    16    20    15
2    27     9     3
3     5    24    27
4     4    26    28
5   112   122   117
6   115   119   114
7   126   108   102
8   104   123   126
9   103   125   127

In [7]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [8]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [9]:
df2.columns=  ["var1","var2","deg3"]
df2

   var1  var2  deg3
0   112   122   117
1   115   119   114
2   126   108   102
3   104   123   126
4   103   125   127

In [10]:
pd.concat([df,df2])

   var1  var2  var3   deg3
0    13    23  18.0    NaN
1    16    20  15.0    NaN
2    27     9   3.0    NaN
3     5    24  27.0    NaN
4     4    26  28.0    NaN
0   112   122   NaN  117.0
1   115   119   NaN  114.0
2   126   108   NaN  102.0
3   104   123   NaN  126.0
4   103   125   NaN  127.0

deg3 değişkeni iki veri setinde olmadığı için bu değişkenin değerleri sorun çıkartacaktır. Zaten kod parçası bir hata döndürecektir

In [11]:
pd.concat([df,df2],join = "inner")

   var1  var2
0    13    23
1    16    20
2    27     9
3     5    24
4     4    26
0   112   122
1   115   119
2   126   108
3   104   123
4   103   125

join parametresini inner yaptığımızda birleştirme işlemi, sadece kesişimin sağlandığı değişkenler üzerinde gerçekleşir. Yani değerleri mutlak şekilde reel elemanlardan oluşan değişkenleri birleştirir

In [15]:
pd.concat([df,df2],join_axes = [df2.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'